10 REM TEST OPEN READ COMMANDS
 Remark:TEST OPEN READ COMMANDS
20 OPEN "data.txt" FOR INPUT AS FILE #1
 TextConstant:"data.txt"
 NumericConstant:1
 UnaryOperatorHash:# filehandle
30 INPUT #1, A,B,C
 NumericConstant:1
 UnaryOperatorHash:# filehandle
 Variable:A scalar
 Variable:B scalar
 Variable:C scalar
40 INPUT #1, N$
 NumericConstant:1
 UnaryOperatorHash:# filehandle
 Variable:N$ scalar
50 CLOSE FILE #1
 NumericConstant:1
 UnaryOperatorHash:# filehandle
60 PRINT N$,A,B,C
 Variable:N$ scalar
 CarriageControl:,
 Variable:A scalar
 CarriageControl:,
 Variable:B scalar
 CarriageControl:,
 Variable:C scalar
 CarriageControl:NL
99 END
 

