10 REM TEST OPEN READ COMMANDS
 Remark:TEST OPEN READ COMMANDS
20 OPEN "data.txt" FOR INPUT AS FILE #1
 TextConstant:"data.txt"
 NumericConstant:1
 UnaryOperatorHash:#(_) -> FH
30 INPUT #1, A,B,C
 NumericConstant:1
 UnaryOperatorHash:#(_) -> FH
 Variable:A -> _
 Variable:B -> _
 Variable:C -> _
40 INPUT #1, N$
 NumericConstant:1
 UnaryOperatorHash:#(_) -> FH
 Variable:N$ -> $
50 CLOSE FILE #1
 NumericConstant:1
 UnaryOperatorHash:#(_) -> FH
60 PRINT N$,A,B,C
 Variable:N$ -> $
 CarriageControl:,
 Variable:A -> _
 CarriageControl:,
 Variable:B -> _
 CarriageControl:,
 Variable:C -> _
 CarriageControl:NL
99 END
 

