10 REM TEST OPEN READ COMMANDS
 Remark:TEST OPEN READ COMMANDS
20 OPEN "data.txt" FOR INPUT AS #1
 TextValue:"data.txt"
 NumericValue:1
 UnaryOperatorHash:#(.) -> =FH
30 INPUT #1, A,B,C
 NumericValue:1
 UnaryOperatorHash:#(.) -> =FH
 Variable:A -> .
 Variable:B -> .
 Variable:C -> .
40 INPUT #1, N$
 NumericValue:1
 UnaryOperatorHash:#(.) -> =FH
 Variable:N$ -> $
50 CLOSE #1
 NumericValue:1
 UnaryOperatorHash:#(.) -> =FH
60 PRINT N$,A,B,C
 Variable:N$ -> $
 CarriageControl:,
 Variable:A -> .
 CarriageControl:,
 Variable:B -> .
 CarriageControl:,
 Variable:C -> .
 CarriageControl:NL
99 END
 

