10 REM TEST OPEN READ COMMANDS
 Remark:TEST OPEN READ COMMANDS
20 OPEN "data.txt" FOR INPUT AS #1
 TextConstant:"data.txt"
 NumericConstant:1
 UnaryOperatorHash:#(_) filehandle
30 INPUT #1, A,B,C
 NumericConstant:1
 UnaryOperatorHash:#(_) filehandle
 Variable:A numeric scalar
 Variable:B numeric scalar
 Variable:C numeric scalar
40 INPUT #1, N$
 NumericConstant:1
 UnaryOperatorHash:#(_) filehandle
 Variable:N$ string scalar
50 CLOSE #1
 NumericConstant:1
 UnaryOperatorHash:#(_) filehandle
60 PRINT N$,A,B,C
 Variable:N$ string scalar
 CarriageControl:,
 Variable:A numeric scalar
 CarriageControl:,
 Variable:B numeric scalar
 CarriageControl:,
 Variable:C numeric scalar
 CarriageControl:NL
99 END
 

